//@strict-types
//добавлен коммент


#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	ТекстСообщения = "Изменилась цена";
	
	РассчитатьСуммуПоСтроке(ТекущиеДанные, ТекстСообщения);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	ТекстСообщения = "Изменилось количество";
	
	РассчитатьСуммуПоСтроке(ТекущиеДанные, ТекстСообщения);
	
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Команда1(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура РассчитатьСуммуПоСтроке(Строка, ТекстПользователю)
	Строка.Сумма = Строка.Количество * Строка.Цена * 0.9;
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстПользователю;
	Сообщение.Сообщить();
	
	Сотрудник = ОписаниеПользователя();
	
КонецПроцедуры


// Описание пользователя.
// 
// Возвращаемое значение:
//  Структура - Описание пользователя:
// * Имя - Строка - 
// * Стаж - Число - 
// * ДатаПриема - Дата - 
// * Штатный - Булево - 
&НаКлиенте
Функция ОписаниеПользователя()
	
	Человек = Новый Структура;
	Человек.Вставить("Имя", "Антон");
	Человек.Вставить("Стаж", 15);
	Человек.Вставить("ДатаПриема", ТекущаяДата());
	Человек.Вставить("Штатный", Истина);
	
	//коммент
	//
	//
	
	Возврат Человек;
	
	
КонецФункции

#КонецОбласти
